# https://www.acmicpc.net/problem/1193

# k:: X:i/j
# 1:: 1:1/1
# 2:: 2:1/2 3:2/1
# 3:: 4:3/1 5:2/2 6:1/3
# 4:: 7:1/4 8:2/3 9:3/2 10:4/1
# 5:: 11:5/1 12:4/2 13:3/3 14:2/4 15:1/5
# 6:: 16:1/6 17:2/5 18:3/4 19:4/3 20:5/2 21:6/1
# 7:: 22:7/1 23:6/2 24:5/3 25:4/4 26:3/5 27:2/6 28:1/7
# 8:: 29:1/8 30:2/7 31:3/6 32:4/5 33:5/4 34:6/3 35:7/2 36:8/1
# 9:: 37:9/1 38:8/2 39:7/3 40:6/4 41:5/5 42:4/6 43:3/7 44:2/8 45:1/9
# 10:: 46:1/10 47:2/9 48:3/8 49:4/7 50:5/6 51:6/5 52:7/4 53:8/3 54:9/2 55:10/1

# X: 항의 번호
# i: 분자
# j: 분모
# k: 항의 개수

# 전략
# sum(k) < X <= sum(k+1)
# k+1번째 항에서 X번째 항까지의 거리는 X - sum(k)
# k+1이 짝수면 분자가 1부터 시작
# k+1이 홀수면 분모가 1부터 시작

X = int(input())

i = 1
j = 1
k = 1

while True:
    high = sum(range(1, k + 1))
    low = sum(range(1, k))
    # print(f"k: {k}, high: {high}, low: {low}")

    if X <= high:
        break

    k += 1

# print(X - low)

if k % 2 == 0:
    i = X - low
    j = k - i + 1
else:
    j = X - low
    i = k - j + 1

print(f"{i}/{j}")
